Repository: Asad120600/online_barber
Catalog: lib/l10n/app_*.arb
Languages: ur

source: Active Users
ur: فعال صارفین

# addProductToCart
source: Product added to cart
ur: مصنوعات کو ٹوکری میں شامل کر دیا گیا

source: Add to Cart
ur: ٹوکری میں شامل کریں

source: Add FAQ
ur: عمومی سوال شامل کریں

source: Add New Slide
ur: نئی سلائیڈ شامل کریں

source: Add Policy
ur: پالیسی شامل کریں

source: Add Products
ur: مصنوعات شامل کریں

source: Add Service
ur: سروس شامل کریں

# add_service_button
source: Add Service
ur: سروس شامل کریں

source: Add services
ur: خدمات شامل کریں

# addingProduct
source: Product is adding....
ur: پروڈکٹ شامل کی جا رہی ہے....

source: Address
ur: پتہ

# addressCannotBeEmpty
source: Address cannot be empty for home service
ur: گھر کی خدمت کے لیے پتہ خالی نہیں ہوسکتا

# addressLabel
source: Address
ur: پتہ

# addressValidation
source: Please enter your address
ur: براہ کرم اپنا پتہ درج کریں

# address_e
source: Address: {address}
ur: پتہ: {address}

source: Admin
ur: ایڈمن

# adminDocNotFound
source: Admin document not found
ur: ایڈمن دستاویز نہیں ملی

source: Admin Orders
ur: ایڈمن آرڈرز

source: Admin Product Management
ur: ایڈمن پروڈکٹ مینجمنٹ

source: Admin Panel
ur: ایڈمن پینل

# allProductsTitle
source: All Products
ur: تمام مصنوعات

source: All Products
ur: تمام مصنوعات

source: Already Claimed
ur: پہلے ہی دعویٰ کیا جا چکا ہے

source: Already Rated
ur: پہلے ہی درجہ بندی کی جا چکی ہے

# already_have_account
source: Already have an account?
ur: کیا آپ کے پاس پہلے سے اکاؤنٹ ہے؟

# announcement
source: Announcements
ur: اعلان

# announcementSent
source: Announcement sent successfully!
ur: اعلان کامیابی سے بھیجا گیا!

source: Announcements
ur: اعلانات

source: Answer
ur: جواب

source: App Settings
ur: ایپ کی ترتیبات

source: Appointment Confirmed
ur: بکنگ کی تصدیق ہو گئی ہے

# appointment_confirmed_message
source: Your appointment on {date} at {time} has been confirmed.
ur: آپ کی بکنگ {date} کو {time} پر تصدیق ہو گئی ہے۔

source: Appointments
ur: ملاقاتیں

source: Approved Requests
ur: منظور شدہ درخواستیں

# are_you_sure_delete_account
source: Are you sure you want to delete your account? This action cannot be undone.
ur: کیا آپ واقعی اپنے اکاؤنٹ کو حذف کرنا چاہتے ہیں؟ یہ عمل واپس نہیں کیا جا سکتا۔

# are_you_sure_sign_out
source: Are you sure you want to sign out?
ur: کیا آپ واقعی سائن آؤٹ کرنا چاہتے ہیں؟

source: Barber
ur: حجام

# barberName
source: Barber Name: {barberName}
ur: باربر کا نام: {barberName}

source: Barber Stats
ur: باربر کے اعدادوشمار

source: Barber Bookings
ur: باربر کی بکنگ

# barber_e
source: Barber: {barber}
ur: حجام: {barber}

# barber_id_empty
source: Barber ID is empty or user not authenticated.
ur: باربر آئی ڈی خالی ہے یا صارف تصدیق شدہ نہیں ہے۔

# barber_id_missing
source: Barber ID is missing or user not authenticated.
ur: باربر کا ID غائب ہے یا صارف کی توثیق نہیں ہوئی ہے۔

source: Barber Stats
ur: حجام کے اعداد و شمار

source: Barbers
ur: حجام

source: Beard Styles
ur: داڑھی کے انداز

source: Book Appointment
ur: وقت مقرر کریں

# bookAppointmentTitle
source: Book Appointment
ur: وقت مقرر کریں

# bookingInProgress
source: Booking is in progress
ur: وقت مقرر ہو رہا ہے

source: Bookings
ur: بکنگز

source: Cancel
ur: منسوخ کریں

# cancelButton
source: Cancel
ur: منسوخ کریں

# cartTitle
source: Cart
ur: ٹوکری

source: Category
ur: زمرہ

source: Change Image
ur: تصویر تبدیل کریں

source: Chat
ur: چیٹ

# checkoutButton
source: Checkout
ur: چیک آؤٹ

# checkoutTitle
source: Checkout
ur: چیک آؤٹ

source: Claim Business
ur: کاروبار دعوی کریں

# claimBusinessButton
source: Claim Business
ur: کاروبار دعوی کریں

# claimSubmitted
source: Claim submitted for {barberName}!
ur: {barberName} کے لیے دعویٰ جمع کر دیا گیا!

# claim_approved
source: Claim approved successfully!
ur: دعوی کامیابی کے ساتھ منظور ہو گیا!

source: Claim Details
ur: دعوی کی تفصیلات

# claim_disapproved
source: Claim disapproved successfully!
ur: دعوی کامیابی کے ساتھ مسترد ہو گیا!

source: Claim Requests
ur: دعویٰ کی درخواستیں

source: Client Name
ur: مؤکل کا نام

source: Close
ur: بند کریں

# commission
source: Commission (10%): {commission}
ur: کمیشن (10%): {commission}

source: Commission for
ur: کمیشن برائے

source: Confirm
ur: تصدیق کریں

# confirmOrderButton
source: Confirm Order
ur: آرڈر کی تصدیق کریں

source: Confirm selection
ur: انتخاب کی تصدیق کریں

source: Confirm Sign Out
ur: سائن آؤٹ کی تصدیق کریں

source: Confirm Delete
ur: حذف کی تصدیق کریں

source: Confirm Delete Account
ur: اکاؤنٹ حذف کرنے کی تصدیق کریں

source: Confirm Password
ur: پاسورڈ کی تصدیق کریں

source: Confirm Sign Out
ur: سائن آؤٹ کی تصدیق کریں

source: Confirmed
ur: تصدیق شدہ

source: Contact Admin
ur: ایڈمن سے رابطہ کریں

source: Contact Us
ur: ہم سے رابطہ کریں

source: Content
ur: مواد

# continue_button
source: Continue
ur: جاری رکھیں

source: Create Announcement
ur: اعلان تخلیق کریں

# date
source: Date: {date}
ur: تاریخ: {date}

# date_e
source: Date: {date}
ur: تاریخ: {date}

# defaultName
source: Barber
ur: باربر

source: Delete
ur: حذف کریں

# deleteButton
source: Delete
ur: حذف کریں

# deleteProductConfirmation
source: Are you sure you want to delete this product?
ur: کیا آپ واقعی اس پروڈکٹ کو حذف کرنا چاہتے ہیں؟

# deleteProductTitle
source: Delete Product
ur: پروڈکٹ حذف کریں

source: Delete Account
ur: اکاؤنٹ حذف کریں

# delete_confirmation_message
source: Are you sure you want to delete this slide?
ur: کیا آپ واقعی اس سلائیڈ کو حذف کرنا چاہتے ہیں؟

source: Deleted at
ur: حذف کیا گیا

source: Deleted Users
ur: حذف شدہ صارفین

source: Delivered
ur: فراہم کردہ

# deliveryAddress
source: Delivery Address: {address}
ur: ڈیلیوری ایڈریس: {address}

source: Description
ur: تفصیل

source: Deselect All
ur: تمام منتخب کو غیر منتخب کریں

# deviceTokenError
source: Device token is not available
ur: ڈیوائس ٹوکن دستیاب نہیں ہے

# distance
source: {distance} km
ur: {distance} کلومیٹر

# distanceWithLabel
source: Distance: {distance} km
ur: فاصلہ: {distance} کلومیٹر

source: Done
ur: مکمل

source: Done appointments
ur: مکمل ملاقاتیں

# dont_have_account
source: Don't have an account? Sign Up
ur: کیا آپ کے پاس اکاؤنٹ نہیں ہے؟ سائن اپ کریں

# earningsLastThreeMonths
source: Earnings for the Last 3 Months
ur: آخری 3 مہینوں کی کمائی

source: Earnings for
ur: آمدنی برائے

source: Edit Product
ur: پروڈکٹ میں ترمیم کریں

source: Edit FAQ
ur: عمومی سوال میں ترمیم کریں

source: Edit Privacy Policy
ur: رازداری کی پالیسی میں ترمیم کریں

source: Edit Service
ur: سروس میں ترمیم کریں

source: Edit Slide
ur: سلائیڈ ترمیم کریں

source: Email
ur: ای میل

# emailLabel
source: Email
ur: ای میل

# emailValidation
source: Please enter your email
ur: براہ کرم اپنی ای میل درج کریں

# email_e
source: Email: {email}
ur: ای میل: {email}

source: English
ur: انگریزی

source: Enter address
ur: پتہ درج کریں

# enterDescription
source: Please enter a description
ur: براہ کرم تفصیل درج کریں

source: Enter phone number
ur: فون نمبر درج کریں

# enterPrice
source: Please enter a price
ur: براہ کرم قیمت درج کریں

# enterProductName
source: Please enter a product name
ur: براہ کرم پروڈکٹ کا نام درج کریں

source: Error
ur: خرابی

source: Error fetching admin UID.
ur: ایڈمن UID حاصل کرنے میں خرابی۔

# errorFetchingData
source: Error fetching data: {e}
ur: ڈیٹا حاصل کرنے میں خرابی: {e}

# errorFetchingLocation
source: Error fetching barber location.
ur: حجام کے مقام کو حاصل کرنے میں خرابی۔

# errorFetchingUserDetails
source: Error fetching user details: {error}
ur: صارف کی تفصیلات حاصل کرنے میں خرابی: {error}

# errorLabel
source: Error: {error}
ur: خرابی: {error}

source: Error loading barber location.
ur: حجام کے مقام کو لوڈ کرنے میں خرابی۔

# errorLoadingData
source: Error loading earnings data.
ur: کمائی کے ڈیٹا کو لوڈ کرنے میں خرابی

# errorLoadingLocation
source: Error loading barber location
ur: باربر کے مقام کو لوڈ کرنے میں غلطی

# errorOccurred
source: An error occurred
ur: ایک خرابی پیش آگئی

# errorPlacingOrder
source: Error placing order: {error}
ur: آرڈر مکمل کرنے میں خرابی: {error}

# error_during_google_sign_in
source: Error during Google sign-in: {error}
ur: گوگل سے لاگ ان کے دوران غلطی: {error}

# error_during_login
source: Error during login: {error}
ur: لاگ ان کے دوران غلطی: {error}

# error_fetching_notifications
source: Error fetching notifications: {error}
ur: اطلاعات لانے میں خرابی: {error}

source: Error fetching product details
ur: مصنوعات کی تفصیلات لانے میں خرابی

# error_loading_appointments
source: Error loading done appointments
ur: مکمل ملاقاتوں کو لوڈ کرنے میں خرابی

source: Error loading FAQs.
ur: عمومی سوالات لوڈ کرنے میں خرابی۔

# error_loading_policies
source: Error loading privacy policies.
ur: رازداری کی پالیسیوں کو لوڈ کرنے میں خرابی۔

# errorr
source: Error: {error}
ur: غلطی: {error}

# failedToAddProduct
source: Failed to add product: {error}
ur: پروڈکٹ شامل کرنے میں ناکام: {error}

# failedToSend
source: Failed to send announcement: {error}
ur: اعلان بھیجنے میں ناکامی: {error}

# failedToUpdate
source: Failed to update profile
ur: پروفائل اپ ڈیٹ کرنے میں ناکام

# failedToUpdateOrder
source: Failed to update order status: {error}
ur: آرڈر اسٹیٹس کو اپ ڈیٹ کرنے میں ناکامی: {error}

# failed_initialize_tabs
source: Failed to initialize tabs.
ur: ٹیبز کو شروع کرنے میں ناکامی۔

source: Failed to delete slide
ur: سلائیڈ حذف کرنے میں ناکام

source: Failed to initialize tabs.
ur: ٹیبز کو شروع کرنے میں ناکامی۔

source: Failed to load slides
ur: سلائیڈز لوڈ کرنے میں ناکام

# failed_to_sign_in
source: Failed to sign in. Please try again.
ur: لاگ ان کرنے میں ناکامی۔ براہ کرم دوبارہ کوشش کریں۔

# failed_to_sign_in_google
source: Failed to sign in with Google. Please try again.
ur: گوگل سے لاگ ان کرنے میں ناکامی۔ براہ کرم دوبارہ کوشش کریں۔

source: FAQs
ur: عمومی سوالات

source: FAQs Settings
ur: عمومی سوالات کی ترتیبات

source: File does not exist
ur: فائل موجود نہیں ہے

source: Find Your Shop
ur: اپنی دکان تلاش کریں

source: First Name
ur: پہلا نام

# firstNameLabel
source: First Name
ur: پہلا نام

# firstNameValidation
source: Please enter your first name
ur: براہ کرم اپنا پہلا نام درج کریں

source: First Name
ur: پہلا نام

# g_notifications
source: General Notifications
ur: عام اطلاعات

source: Hair Styles
ur: بالوں کے انداز

# hello
source: Hello 👋, {firstName}
ur: ہیلو 👋، {firstName}

source: Hello 👋, {Admin}
ur: ہیلو 👋، {Admin}

# hello_user
source: Hello 👋, {firstName}
ur: ہیلو {firstName}

source: History
ur: تاریخ

source: Home Service
ur: گھر کی خدمت

source: Home Service Price
ur: گھر کی خدمت کی قیمت

# homeServicePriceHint
source: Enter price
ur: قیمت درج کریں

source: Home Service
ur: گھر کی سروس

source: Home Service: No
ur: گھر کی سروس: نہیں

source: Home Service Price
ur: ہوم سروس کی قیمت

# home_service_price_required
source: Please enter a home service price
ur: براہ کرم ہوم سروس کی قیمت درج کریں

source: Home Service: Yes
ur: گھر کی سروس: ہاں

source: Image Name
ur: تصویر کا نام

source: Image selected
ur: تصویر منتخب کر لی گئی

source: Image Text
ur: تصویر کا متن

source: Invalid home service price
ur: گھر کی خدمت کی قیمت غلط ہے

# invalidToken
source: Invalid token or message
ur: غلط ٹوکن یا پیغام

# invalid_phone_number
source: Please enter a valid phone number.
ur: براہ کرم ایک درست فون نمبر درج کریں۔

source: Is Home Service?
ur: کیا یہ ہوم سروس ہے؟

source: Last Name
ur: آخری نام

# lastNameLabel
source: Last Name
ur: آخری نام

# lastNameValidation
source: Please enter your last name
ur: براہ کرم اپنا آخری نام درج کریں

source: Last Name
ur: آخری نام

source: Loading...
ur: لوڈ ہو رہا ہے...

source: Loading Barber Location...
ur: باربر کا مقام لوڈ ہو رہا ہے...

source: Loading product...
ur: مصنوعات لوڈ ہو رہی ہے...

# loadingText
source: Loading...
ur: لوڈ ہو رہا ہے...

# loading_congratulations
source: Congratulations!
ur: مبارک ہو!

# loading_error
source: Error: {error}
ur: غلطی: {error}

# loading_message
source: Logging in...
ur: لاگ ان ہو رہا ہے...

source: Loading product details...
ur: مصنوعات کی تفصیلات لوڈ ہو رہی ہیں...

# locationPermissionsDenied
source: Location permissions are denied.
ur: مقام کی اجازتیں مسترد کردی گئیں۔

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied.
ur: مقام کی اجازتیں مستقل طور پر مسترد کردی گئیں۔

# locationServicesDisabled
source: Location services are disabled.
ur: مقام کی خدمات غیر فعال ہیں۔

source: Logging in...
ur: لاگ ان ہو رہا ہے...

source: Login
ur: لاگ ان کریں

# login_admin
source: Login as Admin
ur: ایڈمن کے طور پر لاگ ان کریں

# login_barber
source: Login as Barber
ur: حجام کے طور پر لاگ ان کریں

# login_user
source: Login as User
ur: صارف کے طور پر لاگ ان کریں

source: Make Announcement
ur: اعلان کریں

source: Manage FAQs
ur: عمومی سوالات کا نظم کریں

source: Manage services
ur: خدمات کا انتظام کریں

source: Manage Slideshow Images
ur: سلائیڈ شو کی تصاویر کا نظم کریں

# maxDistance
source: Max Distance: {distance} km
ur: زیادہ سے زیادہ فاصلے: {distance} کلومیٹر

source: Message
ur: پیغام

source: My Appointments
ur: میرے اپائنٹمنٹس

source: My Chats
ur: میری چیٹس

# name
source: Name: {firstName} {lastName}
ur: نام: {firstName} {lastName}

# name_e
source: Name: {name}
ur: نام: {name}

source: National ID
ur: قومی شناختی نمبر

source: No
ur: نہیں

source: No Address
ur: کوئی پتہ نہیں

# noAppointments
source: No Appointments found.
ur: کوئی ملاقاتیں نہیں ملیں

source: No Appointments found.
ur: کوئی ملاقاتیں نہیں ملیں۔

source: No barbers available
ur: کوئی حجام دستیاب نہیں ہیں

source: No data found
ur: کوئی ڈیٹا نہیں ملا

source: No Description
ur: تفصیل دستیاب نہیں

# noEarningsData
source: No earnings data available
ur: کوئی کمائی کا ڈیٹا دستیاب نہیں

source: No Name
ur: کوئی نام نہیں

source: No products available
ur: کوئی مصنوعات دستیاب نہیں ہیں

source: No recent orders
ur: کوئی حالیہ آرڈرز نہیں ہیں

source: No services
ur: کوئی خدمات نہیں

source: No services selected.
ur: کوئی خدمات منتخب نہیں کی گئیں۔

source: No Shop Name
ur: کوئی دکان کا نام نہیں

source: No Appointments found.
ur: کوئی ملاقاتیں نہیں ملیں۔

# no_approved_claims
source: No approved claims available
ur: کوئی منظور شدہ دعوے دستیاب نہیں ہیں

source: No barbers found.
ur: کوئی حجام نہیں ملا۔

source: No Bookings found.
ur: کوئی بکنگز نہیں ملیں۔

source: No Date
ur: کوئی تاریخ نہیں

# no_deleted_users
source: No deleted users found.
ur: کوئی حذف شدہ صارف نہیں ملا۔

source: No description
ur: کوئی تفصیل نہیں

source: No Email
ur: کوئی ای میل نہیں

source: No FAQs available.
ur: کوئی عمومی سوالات دستیاب نہیں ہیں۔

source: No First Name
ur: کوئی پہلا نام نہیں

source: No image selected
ur: کوئی تصویر منتخب نہیں کی گئی

source: No Last Name
ur: کوئی آخری نام نہیں

source: No Name
ur: کوئی نام نہیں

source: No notifications available.
ur: کوئی اطلاعات دستیاب نہیں ہیں۔

# no_pending_claims
source: No pending claims available
ur: کوئی زیر التواء دعوے دستیاب نہیں ہیں

# no_policies_available
source: No privacy policies available.
ur: کوئی رازداری کی پالیسی دستیاب نہیں ہے۔

source: No services
ur: کوئی سروسز نہیں

source: No slides available
ur: کوئی سلائیڈز دستیاب نہیں ہیں

source: No Time
ur: کوئی وقت نہیں

source: No User Type
ur: کوئی صارف کی قسم نہیں

# no_users
source: No users found.
ur: کوئی صارف نہیں ملا۔

source: Notifications
ur: نوٹیفکیشن

# o_notifications
source: Order Notifications
ur: آرڈر کی اطلاعات

source: OK
ur: اوکے

source: Online Barber
ur: آن لائن حجام

source: Order Confirmed
ur: آرڈر کی تصدیق ہوگئی

# orderConfirmedBody
source: Your order {orderId} has been confirmed.
ur: آپ کا آرڈر {orderId} تصدیق ہوگیا ہے۔

source: Order Delivered
ur: آرڈر فراہم کردیا گیا

# orderDeliveredBody
source: Your order {orderId} has been delivered.
ur: آپ کا آرڈر {orderId} فراہم کردیا گیا ہے۔

# orderId
source: Order ID: {orderId}
ur: آرڈر ID: {orderId}

source: Order placed successfully!
ur: آرڈر کامیابی سے مکمل ہوا!

source: Order Shipped
ur: آرڈر روانہ کردیا گیا

# orderShippedBody
source: Your order {orderId} has been shipped.
ur: آپ کا آرڈر {orderId} روانہ کردیا گیا ہے۔

source: Order Summary
ur: آرڈر کا خلاصہ

# order_date
source: Order Date: {orderDate}
ur: آرڈر کی تاریخ: {orderDate}

# order_id
source: Order ID: {orderId}
ur: آرڈر آئی ڈی: {orderId}

source: Order Notifications
ur: آرڈر کی اطلاعات

source: Orders
ur: آرڈرز

source: Password
ur: پاسورڈ

# password_mismatch
source: Passwords do not match. Please try again.
ur: پاسورڈ میچ نہیں کرتا۔ براہ کرم دوبارہ کوشش کریں۔

source: Password Visibility
ur: پاسورڈ کی نمائش

source: pending
ur: زیر التواء

source: Pending Requests
ur: زیر التواء درخواستیں

# phone
source: Phone: {phone}
ur: فون: {phone}

# phoneLabel
source: Phone
ur: فون

source: Phone Number
ur: فون نمبر

source: Phone number cannot be empty
ur: فون نمبر خالی نہیں ہوسکتا

# phoneValidation
source: Please enter your phone number
ur: براہ کرم اپنا فون نمبر درج کریں

# phone_e
source: Phone: {phone}
ur: فون: {phone}

source: Phone Number
ur: فون نمبر

# phone_number_e
source: Phone Number: {phone}
ur: فون نمبر: {phone}

source: Pick Image
ur: تصویر منتخب کریں

source: Pick Image
ur: تصویر منتخب کریں

# pleaseEnterTitleMessage
source: Please enter both a title and a message.
ur: براہ کرم عنوان اور پیغام دونوں درج کریں۔

# pleaseSelectTimeSlot
source: Please select a time slot
ur: براہ کرم وقت کا وقفہ منتخب کریں

source: Please enter email and password.
ur: براہ کرم ای میل اور پاس ورڈ درج کریں۔

source: Price
ur: قیمت

# priceLabel
source: Price: {price}
ur: قیمت: {price}

# price_required
source: Please enter a price
ur: براہ کرم قیمت درج کریں

# pricee
source: Price: {price}
ur: قیمت: {price}

source: Privacy Policy
ur: رازداری کی پالیسی

source: Privacy Policy Settings
ur: رازداری کی پالیسی کی ترتیبات

source: Product added
ur: پروڈکٹ شامل کر دی گئی

source: Product added successfully!
ur: پروڈکٹ کامیابی سے شامل ہو گئی!

# productDeletedError
source: Failed to delete product: {error}
ur: پروڈکٹ حذف کرنے میں ناکامی: {error}

# productDeletedSuccess
source: Product deleted successfully
ur: پروڈکٹ کامیابی سے حذف کر دی گئی

# productListTitle
source: Product List
ur: مصنوعات کی فہرست

source: Product Name
ur: پروڈکٹ کا نام

source: Product not found
ur: مصنوعہ نہیں ملا

# productUpdated
source: Product updated successfully
ur: پروڈکٹ کامیابی سے اپ ڈیٹ ہو گیا

source: Products
ur: پروڈکٹس

source: Profile
ur: پروفائل

# profileUpdated
source: Profile updated successfully
ur: پروفائل کامیابی سے اپ ڈیٹ ہو گیا

# profileUpdating
source: Profile is Updating!
ur: پروفائل اپ ڈیٹ ہو رہا ہے!

# quantity
source: Quantity: {quantity}
ur: مقدار: {quantity}

# quantityLabel
source: Quantity: {quantity}
ur: مقدار: {quantity}

# quantity_e
source: Quantity: {quantity}
ur: مقدار: {quantity}

source: Question
ur: سوال

source: Rate Barber
ur: باربر کی درجہ بندی کریں

source: Rating
ur: درجہ بندی

source: Recent Orders
ur: حالیہ آرڈرز

source: Recent Orders
ur: حالیہ آرڈرز

# required_fields_error
source: All fields are required. Please fill out every field.
ur: تمام فیلڈز ضروری ہیں۔ براہ کرم ہر فیلڈ کو مکمل کریں۔

source: Reset Notifications
ur: نوٹیفکیشن ری سیٹ کریں

# save
source: Save Prices
ur: قیمتیں محفوظ کریں۔

source: Save Changes
ur: تبدیلیاں محفوظ کریں

source: Save Product
ur: پروڈکٹ محفوظ کریں

# save_changes_button
source: Save Changes
ur: تبدیلیاں محفوظ کریں

# save_failed
source: Failed to save slide
ur: ڈیٹا محفوظ کرنے میں ناکامی

source: Save Slide
ur: سلائیڈ محفوظ کریں

source: Select All
ur: تمام منتخب کریں

# selectBarber
source: Select a Barber
ur: حجام منتخب کریں

source: Select Date
ur: تاریخ منتخب کریں

source: Select time
ur: وقت منتخب کریں

source: Select Time Slot
ur: وقت کا وقفہ منتخب کریں

source: Select Users
ur: صارفین کو منتخب کریں

source: Select Month:
ur: مہینہ منتخب کریں:

source: Selected Services
ur: منتخب کردہ خدمات

source: Send Announcement
ur: اعلان بھیجیں

# sendingNotificationError
source: Error sending notification: {error}
ur: اطلاع بھیجنے میں خرابی: {error}

# service_added
source: Service is Adding
ur: سروس شامل کی جا رہی ہے

source: Service Name
ur: سروس کا نام

# service_name_required
source: Please enter a service name
ur: براہ کرم سروس کا نام درج کریں

source: Services
ur: خدمات

# services_title
source: Our Services
ur: ہماری خدمات

source: Set prices
ur: قیمتیں مقرر کریں

# set_prices
source: Set Service Prices
ur: سروس کی قیمتیں مقرر کریں۔

source: Shipped
ur: روانہ

source: Shop
ur: دکان

source: Shop Name
ur: دکان کا نام

source: Sign Out
ur: سائن آؤٹ کریں

# signOutButton
source: Sign Out
ur: سائن آؤٹ کریں

# signOutConfirmation
source: Are you sure you want to sign out?
ur: کیا آپ واقعی سائن آؤٹ کرنا چاہتے ہیں؟

source: Sign in with Google
ur: گوگل کے ساتھ سائن ان کریں

source: Sign Out
ur: سائن آؤٹ

# sign_out_confirmation
source: Are you sure you want to sign out?
ur: کیا آپ واقعی لاگ آؤٹ کرنا چاہتے ہیں؟

source: Sign Up
ur: سائن اپ کریں

# sign_up_failed
source: Sign up failed. Phone number already registered.
ur: سائن اپ ناکام ہوگیا۔ فون نمبر پہلے ہی رجسٹرڈ ہے۔

source: Slide deleted successfully
ur: سلائیڈ کامیابی کے ساتھ حذف ہوگئی

source: Slide Show Settings
ur: سلائیڈ شو کی ترتیبات

source: Something went wrong
ur: کچھ غلط ہو گیا

source: Stats
ur: اعدادوشمار

# status
source: Status: {status}
ur: حیثیت: {status}

# status_e
source: Status: {status}
ur: حالت: {status}

source: Success
ur: کامیابی

# time
source: Time: {time}
ur: وقت: {time}

# time_e
source: Time: {time}
ur: وقت: {time}

source: Title
ur: عنوان

source: Today Bookings
ur: آج کی بکنگ

# total
source: Total: {total}
ur: کل: {total}

# totalEarnings
source: Total Earnings: {totalEarnings}
ur: مجموعی کمائی: {totalEarnings}

source: Total Price
ur: کل قیمت

# totalPriceLabel
source: Total: {totalPrice}
ur: کل: {totalPrice}

source: Total Price
ur: مجموعی قیمت

# total_price_e
source: Total Price: {totalPrice}
ur: کل قیمت: {totalPrice}

source: Total Prices
ur: کل قیمتیں

source: Upcoming
ur: آنے والا بکنگز

source: Update Product
ur: پروڈکٹ کو اپ ڈیٹ کریں

# update_profile_message
source: Please update your Address and Shop Name in profile settings.
ur: براہ کرم اپنے پروفائل سیٹنگز میں پتہ اور دکان کا نام اپ ڈیٹ کریں۔

source: Upload Barbers
ur: حجام اپ لوڈ کریں

# upload_failed
source: Failed to upload image
ur: تصویر اپ لوڈ کرنے میں ناکام

source: Upload Image
ur: تصویر اپ لوڈ کریں

source: Urdu
ur: اردو

source: User
ur: صارف

# userIdEmpty
source: User ID is empty or user not authenticated.
ur: صارف کا آئی ڈی خالی ہے یا صارف تصدیق شدہ نہیں ہے۔

source: User Type
ur: صارف کی قسم

source: Users
ur: صارفین

source: Yes
ur: ہاں
